A seguir, explico detalhadamente e passo a passo como realizar a configura√ß√£o b√°sica em switches Cisco (S1 e S2), utilizando a interface de linha de comando (CLI):

---

### ‚úÖ **Parte 1: Configura√ß√£o b√°sica no S1 e S2**

---

### üîπ **Etapa 1: Configurar o nome do host**

**Objetivo:** Alterar o nome do dispositivo para "S1" (ou "S2" no segundo switch).

**Passos:**

1. Clique no switch (ex: S1).
2. V√° para a aba **CLI**.
3. Digite os comandos abaixo:

```bash
Switch> enable
Switch# configure terminal
Switch(config)# hostname S1
```

> Resultado: o prompt mudar√° de `Switch(config)#` para `S1(config)#`, indicando que o nome foi alterado com sucesso.

> **No S2**, substitua `S1` por `S2`.

---

### üîπ **Etapa 2: Configurar senhas e acesso**

#### **a. Senha do console: `cisco`**

```bash
S1(config)# line console 0
S1(config-line)# password cisco
S1(config-line)# login
S1(config-line)# exit
```

#### **b. Senha do modo EXEC privilegiado: `class` (criptografada)**

```bash
S1(config)# enable secret class
```

#### **c. Habilitar criptografia de senhas do tipo `password`**

```bash
S1(config)# service password-encryption
```

---

### üîπ **Etapa 3: Verificar se as senhas foram configuradas corretamente**

**Comando para verificar:**

```bash
S1# show running-config
```

**Verifique:**

* Se h√° a linha: `enable secret 5 <senha criptografada>`
* Se h√°: `line console 0` seguido de `password 7 <senha criptografada>` e `login`

> Isso confirma que ambas as senhas est√£o configuradas e criptografadas.

---

### üîπ **Etapa 4: Configurar o banner de aviso**

**Comando:**

```bash
S1(config)# banner motd #Somente Acesso Autorizado. Infratores sofrer√£o as consequ√™ncias da lei.#
```

> O caractere `#` delimita o in√≠cio e o fim do texto do banner. Voc√™ pode usar outro caractere que **n√£o apare√ßa no texto**.

---

### ‚úÖ Resultado Esperado:

Ao final, voc√™ deve ver no `show running-config`:

* Nome do host alterado
* Senhas configuradas e criptografadas
* Banner configurado
* Senha de console ativa

---

### ‚úÖ **Etapa 4: Salvar o arquivo de configura√ß√£o na NVRAM**

**Pergunta:**
**Qual comando voc√™ emite para executar esta etapa?**

**Resposta objetiva:**

```bash
copy running-config startup-config
```

> Esse comando salva a configura√ß√£o atual (em RAM) na NVRAM, garantindo que seja mantida ap√≥s o rein√≠cio do equipamento.

### ‚úÖ **Parte 2: Configurar os PCs**

---

### üîπ **Etapa 1: Configurar IPs em PC1 e PC2**

**Para PC1:**

1. Clique em **PC1**.
2. V√° na aba **Desktop**.
3. Clique em **IP Configuration**.
4. Insira:

   * **IP Address**: `192.168.1.1`
   * **Subnet Mask**: `255.255.255.0`

**Para PC2:**

1. Clique em **PC2**.
2. V√° na aba **Desktop**.
3. Clique em **IP Configuration**.
4. Insira:

   * **IP Address**: `192.168.1.2`
   * **Subnet Mask**: `255.255.255.0`

---

### üîπ **Etapa 2: Testar a conectividade com o switch S1**

1. No **PC1**, clique na aba **Desktop > Command Prompt**.
2. Digite:

```bash
ping 192.168.1.253
```

---

### ‚ùì **Pergunta: Deu certo? Explique.**

**Resposta:**

**Depende.** O comando `ping 192.168.1.253` s√≥ funcionar√° se **S1 tiver um endere√ßo IP configurado na VLAN 1 (ou na VLAN correta)** com o IP `192.168.1.253`.

---

### üîç **Verifica√ß√£o no switch S1:**

Voc√™ precisa ter executado este comando no S1 anteriormente:

```bash
S1(config)# interface vlan 1
S1(config-if)# ip address 192.168.1.253 255.255.255.0
S1(config-if)# no shutdown
```

E S1 deve estar **conectado via cabo ao PC1** em portas ativas.

---

### ‚úÖ **Se tudo estiver correto:**

* O ping funcionar√° e mostrar√°:

```
Reply from 192.168.1.253: bytes=32 time<1ms TTL=255
```

### ‚ùå **Se n√£o funcionar:**

* Voc√™ ver√°:

```
Request timed out.
```

---

